app/controllers/school_classes_controller.rb

  def create
    @schoolclass = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
    @schoolclass.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "sdf"], ["room_number", 0]]

  def update
    @schoolclass = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]